bjones1/pic24lib_all/chap13/ecan_example_fifo.c
/*
 * "Copyright (c) 2008 Robert B. Reese, Bryan A. Jones, J. W. Bruce ("AUTHORS")"
 * All rights reserved.
 * (R. Reese, reese_AT_ece.msstate.edu, Mississippi State University)
 * (B. A. Jones, bjones_AT_ece.msstate.edu, Mississippi State University)
 * (J. W. Bruce, jwbruce_AT_ece.msstate.edu, Mississippi State University)
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 *
 *
 */
#include "pic24_all.h"
#include <stdio.h>

/** \file
Illustrate CAN transmit, receive. Uses a FIFO for RX receive, and
uses a standard data frame.
*/

/**
Clock config taken from the PIC24H FRM ECAN datasheet (DS70226B, Example 21-9),
Produces data rate of 1 Mbps assuming FCY = 40 MHz, quanta = 20, Prescale = 2.
**/

void configBaudECAN1(void) { //set baud rate
 // The following were removed from the PIC24 Library due to Microchip removing support for them in their recent documentation for the PIC24 - rnn13
 //  C1CTRL1bits.CANCKS = ECAN_FCAN_IS_FCY; // CANCKS = 1, sets FCAN = FCY = 40 MHz
    
 #ifdef __dsPIC33E__ // Microchip added support for CANCKS for the dsPIC33EP, but it has a different meaning now - rnn13
  // Set the ECAN Module Clock to FCY
  C1CTRL1bits.CANCKS = ECAN_CxCTRL1_CANCKS_FCAN_IS_FP;
 #endif
    
    
#if FCY == GET_FCY(FRCPLL_FCY40MHz) // <- This needs to be reverified! - Ryan Nazaretian
 // FCAN = FCY = 40 MHz. TQ = 20. Prescale = 2, Data Rate = FCAN/(TQ * pre) = 40MHz/40 = 1 MHz.
 // 20 TQ for a bit time. 20 = Sync(1) + Seg1 (8) + Seg2 (6) + Prop seg (5)
 
  // Configure C1CFG1: ECAN1 Baud Rate Configuration Register 1
 C1CFG1bits.SJW = ECAN_CxCFG1_SJW_LEN_4TQ;                                      //use maximum sync jump width
 C1CFG1bits.BRP = ECAN_CxCFG1_BRP_PRE_2x2x1;                                    //prescalers to 2x1

 // Configure C1CFG2: ECAN1 Baud Rate Configuration Register 2
 C1CFG2bits.WAKFIL =   ECAN_CxCFG2_WAKFIL_DONT_USE_BUS_LINE_FILTER_FOR_WAKEUP;  //CAN bus line filter is not used for wake-up
 C1CFG2bits.SAM =      ECAN_CxCFG2_SAM_SAMPLE_3X_AT_SAMPLE_POINT;               //sample three times at sample point
 C1CFG2bits.SEG1PH =   ECAN_CxCFG2_SEG1PH_LEN_8;                                //seg1 = 8 TQ
 C1CFG2bits.SEG2PHTS = ECAN_CxCFG2_SEG2PHTS_FREELY_PROG;                        //seg2 is programmable
 C1CFG2bits.SEG2PH =   ECAN_CxCFG2_SEG2PH_LEN_6;                                //seg2 = 6 TQ
 C1CFG2bits.PRSEG =    ECAN_CxCFG2_PRSEG_LEN_5;                                 //propagation delay segment = 5 TQ

#elif FCY == GET_FCY(FRCPLL_FCY60MHz)
 // FCAN = FCY = 60 MHz. TQ = 15. Prescale = 4, Data Rate = FCAN/(TQ * Prescale) = 60MHz/60 = 1 MHz.
 // Bit Time = [ Sync Segment(1) + Propagation Delay(4) + Phase Segment 1(5) + Phase Segment 2(5) ] = 15 * TQ

 // Configure C1CFG1: ECAN1 Baud Rate Configuration Register 1
 C1CFG1bits.SJW = ECAN_CxCFG1_SJW_LEN_4TQ;                                      // Synchronization Jump Width set to 4 TQ */
                                                                                // CiCFG1<BRP> = (FCAN /(2 ×N×FBAUD)) – 1
 C1CFG1bits.BRP = ECAN_CxCFG1_BRP_PRE_2x4x1;                                    // Prescale: TQ = 2x4x1/FCAN

 // Configure C1CFG2: ECAN1 Baud Rate Configuration Register 2
 C1CFG2bits.WAKFIL =   ECAN_CxCFG2_WAKFIL_DONT_USE_BUS_LINE_FILTER_FOR_WAKEUP;  // CAN bus line filter is not used for wake-up
 C1CFG2bits.SEG1PH = ECAN_CxCFG2_SEG1PH_LEN_8;                                  // Phase Segment 1 time is 8 TQ
 C1CFG2bits.SEG2PHTS = ECAN_CxCFG2_SEG2PHTS_FREELY_PROG;                        // Phase Segment 2 time is set to be programmable
 C1CFG2bits.SEG2PH = ECAN_CxCFG2_SEG2PH_LEN_6;                                  // Phase Segment 2 time is 6 TQ
 C1CFG2bits.PRSEG = ECAN_CxCFG2_PRSEG_LEN_5;                                    // Propagation Segment time is 5 TQ
 C1CFG2bits.SAM = ECAN_CxCFG2_SAM_SAMPLE_3X_AT_SAMPLE_POINT;                    // Bus line is sampled three times at the sample point

#else
 #warning "ECAN module not configured for current processor frequency! Edit function configECAN1()."

#endif
}

#define NUM_TX_BUFS  1   //reserve 1 for TX
#define NUM_BUFS    8   //make this a power of 2 for the alignment to work or enter alignment manually

//base message ID
#define MSG_ID 0x7A0    //arbitrary choice for 11-bit messsage ID

#ifdef __PIC24HJ64GP502__  // <- This needs to be reverified! - Ryan Nazaretian
    ECANMSG msgBuf[NUM_BUFS] __attribute__((space(dma),aligned(NUM_BUFS*16)));

    //configure DMA transmit buffer
    void configDMA0(void) {
      DMACS0 = 0;
      _DMA0IF = 0;
      DMA0PAD = (unsigned int) &C1TXD;
      DMA0REQ = DMA_IRQ_ECAN1TX;
      DMA0STA = __builtin_dmaoffset(msgBuf);
      DMA0CNT =   7;  //8 words in ECANMSG
      DMA0CON =   //configure and enable the module Module
        (DMA_MODULE_ON |
         DMA_SIZE_WORD |
         DMA_DIR_WRITE_PERIPHERAL |
         DMA_INTERRUPT_FULL |
         DMA_NULLW_OFF |
         DMA_AMODE_PERIPHERAL_INDIRECT |
         DMA_MODE_CONTINUOUS);
    }

    //configure DMA receive buffer
    void configDMA1(void) {
      _DMA1IF = 0;
      DMA1PAD = (unsigned int) &C1RXD;
      DMA1REQ = DMA_IRQ_ECAN1RX;
      DMA1STA = __builtin_dmaoffset(msgBuf);
      DMA1CNT =  7; //8 words in ECANMSG
      DMA1CON =   //configure and enable the module Module
        (DMA_MODULE_ON |
         DMA_SIZE_WORD |
         DMA_DIR_READ_PERIPHERAL |
         DMA_INTERRUPT_FULL |
         DMA_NULLW_OFF |
         DMA_AMODE_PERIPHERAL_INDIRECT |
         DMA_MODE_CONTINUOUS);

    }
#elif __dsPIC33EP128GP504__

    ECANMSG msgBuf[NUM_BUFS] __attribute__((space(xmemory),aligned(NUM_BUFS*16)));

    //configure DMA transmit buffer
    void configDMA0(void) {
      DMAPWC = 0; // Reset the DMA Peripheral Write Collision Status Register
      _DMA0IF = 0;
      DMA0PAD = (unsigned int) &C1TXD;
      DMA0REQ = DMA_IRQ_ECAN1TX;
      DMA0STAL = (unsigned int) &msgBuf;
      DMA0STAH = (unsigned int) &msgBuf;
      DMA0CNT =   7;  //8 words in ECANMSG
      DMA0CON =   //configure and enable the module Module
        (DMA_MODULE_ON |
         DMA_SIZE_WORD |
         DMA_DIR_WRITE_PERIPHERAL |
         DMA_INTERRUPT_FULL |
         DMA_NULLW_OFF |
         DMA_AMODE_PERIPHERAL_INDIRECT |
         DMA_MODE_CONTINUOUS);
    }

    //configure DMA receive buffer
    void configDMA1(void) {
      _DMA1IF = 0;
      DMA1PAD = (unsigned int) &C1RXD;
      DMA1REQ = DMA_IRQ_ECAN1RX;
      DMA1STAL = (unsigned int) &msgBuf;
      DMA1STAH = (unsigned int) &msgBuf;
      DMA1CNT =  7; //8 words in ECANMSG
      DMA1CON =   //configure and enable the module Module
        (DMA_MODULE_ON |
         DMA_SIZE_WORD |
         DMA_DIR_READ_PERIPHERAL |
         DMA_INTERRUPT_FULL |
         DMA_NULLW_OFF |
         DMA_AMODE_PERIPHERAL_INDIRECT |
         DMA_MODE_CONTINUOUS);
    }

#else
#error "Configure DMA for your chip here."

#endif

#define RX_BUFFER_ID  15  //a value of 15 means to use a FIFO for RX

void configECAN1() {
  uint8_t u8_i;
  CHANGE_MODE_ECAN1(ECAN_CxCTRL1_REQOP_MODE_CONFIGURE);
  configBaudECAN1();
  C1FCTRLbits.FSA = ECAN_CxFCTRL_FSA_1;
  C1FCTRLbits.DMABS = ECAN_CxFCTRL_DMABS_8;
//use Filter 0 with Mask 0
  configRxFilterECAN1(0, MSG_ID, ECAN_CxRXFnSID_EXIDE_STANDARD, RX_BUFFER_ID, 0);
  configRxMaskECAN1(0, 0x7FC, 0, 0);  //check all but last two bits
  clrRxFullOvfFlagsECAN1();  //clear all RX full, overflow flags.

//first 8 buffs must be configured as either TX or TX
  for (u8_i = 0; u8_i<8; u8_i++) {
    if (u8_i < NUM_TX_BUFS)
      configTxRxBufferECAN1(u8_i,ECAN_TX_BUFF,3);
    else
      configTxRxBufferECAN1(u8_i,ECAN_RX_BUFF,3);
  }
  configDMA0();    //do DMA config after ECAN has been initialized
  configDMA1();
  CHANGE_MODE_ECAN1(ECAN_CxCTRL1_OPMODE_MODE_NORMAL);
}

uint32_t rrot32(uint32_t u32_x) {
  if (u32_x & 0x1) {
    u32_x = u32_x >> 1;
    u32_x = u32_x | 0x8000;
  } else u32_x = u32_x >> 1;
  return u32_x;
}

int main (void) {
  uint32_t u32_out0, u32_out1, u32_in0, u32_in1;
  uint8_t rx_buff_id, u8_cnt;
  configBasic(HELLO_MSG);
  configECAN1();
  CHANGE_MODE_ECAN1(ECAN_CxCTRL1_OPMODE_MODE_LOOPBACK);  //loopback to ourself for a test.
  u32_out0 = 0xFEDCBA98;
  u32_out1 = 0x76543210;
  u8_cnt = 0;

  while (1) {
    DELAY_MS(500);
    msgBuf[0].data.u32[0] = u32_out0; //save in CAN message
    msgBuf[0].data.u32[1] = u32_out1;
    //format Buffer 0 for TX with SID=MSG_ID, data length = 8 bytes
    formatStandardDataFrameECAN(&msgBuf[0], MSG_ID+u8_cnt, 8);
    startTxECAN1(0);  //start transmission of buffer 0
    while (getTxInProgressECAN1(0)) {
      doHeartbeat(); //wait for transmission to end.
    }
    _DMA0IF = 1;
    DELAY_MS(10);  //delay for reception
    if (!_DMA1IF) {
      printf("Message ID 0x%X rejected by acceptance filter.\n",MSG_ID+u8_cnt);
    } else {
      _DMA1IF = 0;   //RX message accepted
      rx_buff_id = GET_FIFO_READBUFFER_ECAN1();
      u32_in0 = msgBuf[rx_buff_id].data.u32[0];
      u32_in1 = msgBuf[rx_buff_id].data.u32[1];
      printf("Rx Buff: %d. Msg ID: 0x%X, Out: 0x%lx%lx, In: 0x%lx%lx\n",
             rx_buff_id, msgBuf[rx_buff_id].w0.SID,u32_out0, u32_out1, u32_in0, u32_in1 );
      clrRxFullFlagECAN1(rx_buff_id);
    }
    u32_out0 = rrot32(u32_out0);
    u32_out1 = rrot32(u32_out1);
    u8_cnt++;
    if (u8_cnt == 8) u8_cnt = 0;
  }//end while
}//end main
